app/Controllers/AuthController.php

INSERT INTO "users" ("username", "email", "password", "role") VALUES ('mamborifa', 'mamborifa@example.com', '$2y$10$IbKKh3BE2CDPRmpBWNW4JeG1/0R6Xs9vQLkoFQPqKjKJsbCdJhTT2', 'student')
---
    public function register()
    {
        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        // Validasi input
        if (!isset($input['username']) || !isset($input['email']) || !isset($input['password']) || !isset($input['role'])) {
            return $this->failValidationError('All fields are required.');
        }

        $hashedPassword = password_hash($input['password'], PASSWORD_BCRYPT);
        // Simpan ke database
        $userModel = new UsersModel();
        $data = [
            'username' => $input['username'],
            'email'    => $input['email'],
            'password' => $hashedPassword, // Password belum di hash
            'role'     => $input['role']
        ];

        if ($userModel->insert($data)) {

SELECT *
FROM "users"
WHERE "email" = 'test123@example.com'
 LIMIT 1
---
    public function login()
    {
        $input = $this->request->getJSON(true) ?? $this->request->getPost();

        // Validasi input
        if (!isset($input['email']) || !isset($input['password'])) {
            return $this->failValidationError('Email and password are required.');
        }

        // Cari user berdasarkan email
        $userModel = new UsersModel();
        $user = $userModel->where('email', $input['email'])->first();