app/Models/TopicsModel.php

    public function getTopicById($id)
    {
        return $this->find($id);
---
SELECT *
FROM "topics"
WHERE "topics"."id" = '1'

    public function findAll(?int $limit = null, int $offset = 0)
    {
        $this->orderBy('id', 'ASC');
        return parent::findAll($limit, $offset);
---
SELECT *
FROM "topics"
ORDER BY "id" ASC